[
  {
    "title": "Indeed Job Market",
    "slug": "indeed-job-market",
    "role": "Creative Director",
    "client": "Indeed Creative",
    "year": "2019",
    "tagline": "Reimagining the job fair for the modern age",
    "summary": "As a creative consultant and designer, I worked closely with the marketing team at Indeed to reinvent the traditional job fair and launch the Indeed Job Market. This series of eight unique events across the United States aimed to provide job seekers with a more engaging and memorable experience. I led the design and creation of a wide range of materials for the event spaces, bringing the overall vision to life and ensuring a memorable experience for attendees nationwide.",
    "tags": [
      "marketing",
      "event design",
      "event planning",
      "job fair",
      "user experience",
      "branding",
      "graphic design",
      "creative consulting"
    ],
    "featured": true,
    "visible": true
  },
  {
    "title": "IBM Watson",
    "slug": "ibm-watson",
    "role": "Senior Art Director",
    "client": "IBM",
    "year": "2011",
    "tagline": "An enduring identity for artificial intelligence",
    "summary": "The visual identity for IBM Watson, the groundbreaking natural language processing computer, was a pioneering effort that broke away from the fictional portrayals of AI often seen in popular culture. As the lead art director, I spearheaded a team that developed a unique blend of design and code, resulting in a visually striking identity that continues to inspire interactive experiences. The project was the culmination of a year of embedded research with the IBM team and collaboration with renowned visual artist Joshua Davis. The final product was prominently featured on the game show Jeopardy, where Watson famously competed against human champions, as well as in television commercials, an extended documentary, and print ads around the world, captivating global audiences. Over a decade later, the Watson identity remains an integral part of IBM's brand, a testament to its lasting impact and enduring relevance. By bridging the gap between the digital and the physical, the identity has become a powerful representation of the possibilities of artificial intelligence, inspiring innovation and setting a new standard for the way AI is presented to the public.",
    "tags": [
      "Art Direction",
      "Visual Identity Design",
      "Brand Development",
      "Natural Language Processing",
      "Artificial Intelligence",
      "IBM Watson",
      "Embedded Research",
      "Collaboration",
      "Interdisciplinary Design",
      "Interactive Experiences",
      "Digital-Physical Integration",
      "Visual Branding",
      "Jeopardy",
      "Television Advertising",
      "Documentary Filmmaking",
      "Print Advertising",
      "Global Audience Engagement",
      "Branding and Identity",
      "User Experience Design",
      "Innovative Technology Representation",
      "Pioneering Efforts",
      "Enduring Relevance",
      "Design Thinking",
      "Creative Problem-Solving."
    ],
    "featured": true,
    "visible": true
  },
  {
    "title": "Metitate.art",
    "slug": "metitate-art",
    "role": "Developer, Designer",
    "client": "Self-directed",
    "year": "2022",
    "tagline": "A portal to mindfulness, discovery, and the joy of reading art",
    "summary": "Metitate.art is my portal to mindfulness, discovery, and the joy of reading art. Over the past 2 years, it has evolved into a personal art history companion, guiding my personal exploration of the vast collection of The Metropolitan Museum of Art.\n<br/><br/>\nEach day on metitate.art, a new gallery is unveiled, showcasing objects ranging from European masterpieces to ancient sarcophagi. An algorithm of my own design prioritizes the most intriguing objects based on factors like age, materials, and artist renown.\n\nUsers can curate their own digital museums by collecting objects and adding them to their personal collections. This feature fosters a sense of ownership and encourages a deeper connection with art, as each collected artifact becomes exclusive to the user.\n<br/><br/>\n<a href=\"https://www.metitate.art\" target=\"_blank\">Visit Metitate.art</a>",
    "tags": [
      "web app",
      "product design",
      "product development",
      "web development",
      "javascript",
      "vue",
      "css",
      "html",
      "side project",
      "mindfulness",
      "ux design",
      "app"
    ],
    "featured": true,
    "visible": true
  },
  {
    "title": "Rising Voices Tribeca",
    "slug": "rising-voices-tribeca",
    "role": "Creative Director",
    "client": "Indeed Creative",
    "year": "2021",
    "tagline": "Rise above the status quo",
    "summary": "Early June, 2021. The Battery, a wedge of land splitting the city's hustle, the breath of summer already clinging thick. Not the finest stroll, not with the humidity painting the air sticky. A woman pushing a stroller, headphones in her ears, podcast drowning out my whispered \"Excuse me\". The path curved ahead, a mundane promise of mysteries as ordinary as a bent lamppost or a chipped brick, waiting to be stumbled upon around the next corner.\n\nRounding the bend, a sight: a blue director's chair, afloat in the air like a mirage. Closer, the full picture emerged. A pyramid, skeletal and loose, built of director's chairs. All bone white, save for one defiant splash of blue at the peak, straining upwards. Like those bicycle sculptures of Ai Weiwei, but this, a rebellion of underrepresented voices. A lone chair, bright and poised, rising above the rest.\n\nInstallation concept and creative direction for the premiere of Rising Voices Season 1, Tribeca Film Festival.",
    "tags": [
      "creative-direction",
      "installation-art",
      "public-art",
      "film-festival",
      "diversity-and-inclusion",
      "visual-storytelling"
    ],
    "featured": false,
    "visible": true
  },
  {
    "title": "Careers in Care by Indeed",
    "slug": "careers-in-care-by-indeed",
    "role": "Creative Director",
    "client": "Indeed",
    "year": "2024",
    "tagline": "Healthcare workers need help, not hype",
    "summary": "As the healthcare industry grappled with the aftermath of the pandemic, Indeed recognized the urgency to address the challenges faced by its workforce: widespread burnout, dissatisfaction, and mass resignations. In response to these challenges, we launched Careers in Care, a comprehensive initiative designed to support healthcare professionals at every stage of their career.\n\nI led a team of designers, writers, photographers, and videographers to create a campaign that showed healthcare workers as people, not heroes. Based on the stories of real healthcare workers, Careers in Care showed how Indeed supports people with career guidance, industry-specific features, education, and more.\n\nUnder my leadership and with the collaboration of cross-functional teams at Indeed, the Careers in Care campaign not only resonated deeply with healthcare workers but also delivered tangible results. We saw a significant increase in consideration for Indeed among healthcare workers, solidifying our position as a trusted partner in their individual, unique careers. Notably, this success coincided with a decline in consideration for our competitors, underscoring the effectiveness of our team’s collaborative approach and the unique value proposition we offered.\n\nWork included naming the campaign, defining language, development of the campaign identity, building an authentic photography library, longform video capture and editing, social video, landing pages, and ongoing creative consultation for future iterations of the campaign.",
    "tags": [
      "healthcare",
      "career development",
      "human resources",
      "marketing",
      "branding",
      "content creation",
      "photography",
      "videography",
      "cross-functional collaboration"
    ],
    "featured": true,
    "visible": false
  },
  {
    "title": "Work Sounds by Indeed",
    "slug": "work-sounds-by-indeed",
    "role": "Creative Director, Designer",
    "client": "Indeed",
    "year": "2023",
    "tagline": "Harmonizing work and sound",
    "summary": "Collaborating closely with my team and producers at You Had Me at Black, I played a key role in the development of Work Sounds, an original album designed to enhance the workday. I helped shape the album's narrative, which combines workplace recordings with melodic instrumentals.\n\nLeading the visual component of the project, I conceptualized, produced, and edited videos for YouTube and TikTok, ensuring the album's unique concept was effectively communicated across platforms.",
    "tags": [
      "music production",
      "album production",
      "audio engineering",
      "sound design",
      "video production",
      "video editing",
      "social media marketing",
      "content creation",
      "workplace wellness",
      "ambient music",
      "Youtube",
      "TikTok"
    ],
    "featured": false,
    "visible": true
  },
  {
    "title": "How to Business by Indeed",
    "slug": "how-to-business-by-indeed",
    "role": "Creative Director",
    "client": "Indeed",
    "year": "2022",
    "tagline": "Hiring made easy for small businesses",
    "summary": "In an effort to help small business owners get the most out of Indeed’s products for employers, we created a series of how-to videos that show them how to attract, hire, and retain great talent.\nI led a creative team of writers and designers to craft five videos covering topics such as how to write an offer letter or job description and ways to hire more strategically.\nWork included script development, storyboarding, director sourcing, casting, production, and post-production.",
    "tags": [
      "video",
      "marketing",
      "small business",
      "hiring",
      "talent acquisition",
      "employer branding",
      "content creation",
      "script writing",
      "storyboarding",
      "video production",
      "video editing"
    ],
    "featured": false,
    "visible": true
  },
  {
    "title": "Work Wellbeing Series",
    "slug": "work-wellbeing-series",
    "role": "Creative Director",
    "client": "Indeed",
    "year": "2020",
    "tagline": "Illustrating the modern philosophy of happiness at work",
    "summary": "Collaborating with Indeed's design team, I helped develop the Work Wellbeing Series, a project inspired by Indeed's three-year study on how people feel at work — the largest of its kind. I conceptualized and created motion graphics based on research insights to illustrate workplace happiness. These videos incorporated Indeed's new illustration style and brand guidelines, which I helped shape alongside the internal team, and served as a tool to communicate the study's findings.",
    "tags": [
      "motion graphics",
      "illustration",
      "brand guidelines",
      "video production",
      "data visualization",
      "workplace wellbeing",
      "research insights",
      "design collaboration"
    ],
    "featured": false,
    "visible": true
  },
  {
    "title": "Lowe's Fix in Six",
    "slug": "lowes-fix-in-six",
    "role": "Senior Art Director",
    "client": "Lowe's",
    "year": "2013",
    "tagline": "A Vine legend",
    "summary": "As an art director, I was part of the team tasked with expanding the groundbreaking success of the Lowe's \"Fix in Six\" campaign. Our challenge was to elevate the concept, crafting a second ‘season’ of videos that were more intricate and unforgettable than the first batch – all within the six-second Vine format.\nCollaborating with a talented group of animators, puppeteers, and stop-motion directors, we transformed everyday home improvement hacks into captivating miniature worlds. This approach pushed the boundaries of visual storytelling on Vine, proving that craft and creativity has the power to engage audiences on a social media platform.",
    "tags": [
      "social media campaigns",
      "art direction",
      "stop-motion animation",
      "puppeteering",
      "visual storytelling",
      "home improvement hacks",
      "DIY tips",
      "creative advertising",
      "brand engagement",
      "miniature worlds",
      "Vine videos",
      "social media marketing",
      "short-form video",
      "content creation"
    ],
    "featured": false,
    "visible": true
  },
  {
    "title": "Mobil 1 Motorsports",
    "slug": "mobil-1-motorsports",
    "role": "Senior Art Director",
    "client": "Mobil 1",
    "year": "2012",
    "tagline": "When a second matters, science matters",
    "summary": "As art director for Mobil 1's motorsports campaign, I brought scientific sophistication to the world of high-performance racing. Leading both NASCAR and Formula 1 initiatives, I developed a visual narrative that transformed complex engineering into compelling storytelling. The campaign unified television and digital content around a central truth: in motorsports, milliseconds matter as much as molecules. Working in close partnership with copywriters and directors, I shaped a visual aesthetic that elevated Mobil 1 beyond traditional sponsorship, showcasing how advanced oil technology becomes pure racing performance.",
    "tags": [
      "graphic design",
      "art direction",
      "motorsports",
      "NASCAR",
      "Formula 1",
      "visual narrative",
      "storytelling",
      "television",
      "digital content",
      "engineering",
      "racing performance",
      "oil technology"
    ],
    "featured": false,
    "visible": true
  },
  {
    "title": "HP: The Power of Touch",
    "slug": "hp-the-power-of-touch",
    "role": "Senior Art Director",
    "client": "HP",
    "year": "2012",
    "tagline": "Humanizing technology through touch",
    "summary": "As Art Director for HP's global consumer PC and laptop campaigns, I developed a creative concept centered on the power of human touch, showcasing the brand's innovative touchscreen technology through emotional storytelling.\n\nThe campaign featured two distinct yet complementary approaches: a television commercial following Robbie Wilde, a deaf DJ who experiences music through touch and creates his art using HP technology, and a minimalist print campaign featuring ethereal, floating hands emerging from white space to engage with HP's touchscreen devices. These visually striking compositions emphasized the intuitive relationship between human and device, helping unify HP's brand presence across 170 markets.",
    "tags": [
      "graphic design",
      "art direction",
      "campaign development",
      "brand strategy",
      "visual storytelling",
      "touchscreen technology",
      "accessibility",
      "print advertising",
      "video production",
      "global marketing"
    ],
    "featured": false,
    "visible": true
  },
  {
    "title": "Godmode Records",
    "slug": "godmode-records",
    "role": "Creative Director",
    "client": "Godmode Records",
    "year": "2013",
    "tagline": "An identity for the unidentifiable",
    "summary": "Hand drawn identity for the Los Angeles based record label, Godmode.",
    "tags": [
      "graphic design",
      "branding",
      "logo design",
      "illustration",
      "hand-drawn",
      "record label",
      "music industry"
    ],
    "featured": false,
    "visible": true
  },
  {
    "title": "Job Seeker Stories",
    "slug": "job-seeker-stories",
    "role": "Creative Consultant",
    "client": "Indeed",
    "year": "2024",
    "tagline": "A video podcast that demystifies the job search",
    "summary": "I collaborated with the YouTube team at Indeed to create the second season of their popular video podcast series, Job Seeker Stories. As a creative consultant, I helped align the teams specific goals for the YouTube platform and audience with the overarching brand vision that drives Indeed's global marketing strategy. The result was a series that not only met the teams objectives but also served to inspire and empower people in their search for meaningful employment, furthering Indeed's mission to be the go to resource for job seekers.",
    "tags": [
      "marketing",
      "video production",
      "creative consulting",
      "brand strategy",
      "YouTube",
      "podcast",
      "job search",
      "employment",
      "Indeed"
    ],
    "featured": false,
    "visible": false
  },
  {
    "title": "Indeed on Youtube",
    "slug": "indeed-on-youtube",
    "role": "Creative Director",
    "client": "Indeed",
    "year": "2024",
    "tagline": "Making the job search more accessible one Youtube video at a time",
    "summary": "As the creative lead, I was part of a collaborative effort to modernize and grow Indeed's YouTube presence. I worked closely with a cross functional team to carefully select the right agency partner that could bring our vision to life. Together, we developed four engaging video series, each with its own distinct creative direction. This involved overseeing all aspects of production, from editing and motion graphics to music selection, casting, set design, and copywriting.The result was a dynamic and cohesive YouTube channel that effectively showcased Indeed's brand and resonated with our target audience of job seekers. Watch more on <a href=\"https://www.youtube.com/indeed\" target=\"_blank\">Youtube</a>.",
    "tags": [
      "video production",
      "content creation",
      "creative consulting",
      "job search",
      "marketing strategy",
      "brand alignment",
      "cross-functional"
    ],
    "featured": false,
    "visible": true
  },
  {
    "title": "The End of the Road",
    "slug": "the-end-of-the-road",
    "role": "Researcher",
    "client": "Self-directed",
    "year": "2010",
    "tagline": "A photographic study on the limitations of digital maps",
    "summary": "The End of the Road was a self-directed interrogation of the limits of the Google Streetview project conducted sporadically from 2008 – 2010. The project explored the tension between the unlimited potential of big data and the very limited realities of physical space by documenting where the Google Streetview car had to physically stop driving and, as a result, stop capturing images. Obstacles such as closed fences, unpassable dirt roads, and even tiny dogs showed how our physical world can obstruct our virtual world.\n\nThe project ended in 2011 when, unsurprisingly, Google designed a workaround for these obstacles by including user submitted photos and who knows what else to stitch together unobstructed images of our world. Still, the project lives on as a reminder of limits of technology and the value of privacy – both as an individual right and a corporate commodity.\n\nView the project on <a href=\"https://www.are.na/miles-gilbert/the-end-of-the-road\" target=\"_blank\">Are.na</a>",
    "tags": [
      "digital-art",
      "data-visualization",
      "google-streetview",
      "privacy",
      "technology-limits",
      "physical-space",
      "virtual-world"
    ],
    "featured": false,
    "visible": true
  },
  {
    "title": "Shooot",
    "slug": "shooot",
    "role": "Creator, Creative Director, Product Designer",
    "client": "Self-directed",
    "year": "2016",
    "tagline": "The camera for happy accidents",
    "summary": "Shooot was a camera app for iPhone that removed the distractions of smartphone photography. The app simulated the waiting period of old school film development by asking users to wait until the next morning to see their photos. Shooot also encouraged users to work without a viewfinder – helping them see the world through their own eyes. We called it \"The Camera for Happy Accidents\".\n\n<a href=\"https://www.instagram.com/explore/tags/shotwithshooot/\" target=\"_blank\">#shotwithshooot on Instagram</a>",
    "tags": [
      "mobile app",
      "photography",
      "camera",
      "film simulation",
      "minimalism",
      "user experience"
    ],
    "featured": false,
    "visible": true
  },
  {
    "title": "IBM Smarter Planet Series",
    "slug": "ibm-smarter-planet-series",
    "role": "Art Director",
    "client": "IBM",
    "year": "2010",
    "tagline": "What will it take to build a smarter planet?",
    "summary": "I led art direction for IBM's Smarter Planet Expert Series, creating interviews that brought IBM's experts and their ideas to light. By designing a focused on-set environment, I enabled direct conversations about security, healthcare, energy, and IoT while maintaining the campaign's visual identity. I paired these personal narratives with macro photography of infrastructure technology, creating a visual dialogue between human expertise and technical systems. This approach reinforced IBM's message while making complex topics accessible for business audiences.",
    "tags": [
      "Orchestrating Visual Narratives: IBMs Smarter Planet Expert Series",
      "strategic_content_creation",
      "technical_visual_design",
      "thought_leader_engagement",
      "contextual_storytelling",
      "accessible_communication",
      "brand_alignment"
    ],
    "featured": false,
    "visible": true
  },
  {
    "title": "IBM Smarter Planet",
    "slug": "ibm-smarter-planet",
    "role": "Senior Art Director",
    "client": "IBM",
    "year": "2010",
    "tagline": "A global vision for a smarter planet",
    "summary": "I worked closely with the great team at <a href=\"https://visitoffice.com/\" target=\"_blank\">Office</a> to bring their Paul Rand-inspired smart icon illustrations to life in a global out of home campaign that helped launch IBM's Smarter Planet initiative. The campaign was displayed on various platforms, from simple bus shelters to entire building facades, allowing people to learn about how IBMs technology is already making the world a smarter place for everyone.",
    "tags": [
      "graphic design",
      "illustration",
      "branding",
      "out of home advertising",
      "smart city",
      "IBM"
    ],
    "featured": false,
    "visible": true
  },
  {
    "title": "Off the Eaten Path",
    "slug": "off-the-eaten-path",
    "role": "Associate Creative Director",
    "client": "Off the Eaten Path",
    "year": "2019",
    "tagline": "Ingredient focused campaign for Off The Eaten Path snacks",
    "summary": "I led the creative direction for an ingredient-focused campaign to launch the new Off The Eaten Path line of snacks. Drawing inspiration from the clean packaging design, we created visual system that stretched across social platforms and helped define the look and feel for the new brand. My work involved guiding a team of 3d modelers to create over 50 individual models of ingredients like rice, snap peas, and peppers, casting and recording voiceovers for both US and international markets, developing a distinctive audio mnemonic for the brand, and collaborating with 3D animators to bring it all together.",
    "tags": [
      "creative direction",
      "social media",
      "3D modeling",
      "voiceover",
      "audio branding",
      "3D animation"
    ],
    "featured": false,
    "visible": false
  },
  {
    "title": "Finn",
    "slug": "finn",
    "role": "Creator, Co-lead, Creative Director",
    "client": "Indeed Creative",
    "year": "2024",
    "tagline": "Transforming creative feedback workflows with artificial intelligence",
    "summary": "What began as a personal solution to streamline creative feedback evolved into an effective AI-powered tool for Indeed's creative teams. I identified a critical pain point: creative professionals were spending excessive time processing and responding to feedback, leading to decreased productivity and creative burnout. Taking initiative, I developed a Chrome extension prototype that dramatically simplified feedback management.\n\nThe initial prototype showed clear impact, reducing feedback processing time and preserving creative energy. This success caught the attention of my colleagues, who saw its practical value in their daily work. Leveraging my technical expertise and understanding of creative workflows, I secured internal funding from Indeed to expand the project.\n\nThe result was Finn, an AI-driven product that not only accelerates feedback processing but also helps maintain creative momentum. By bridging my experience in creative direction with technical innovation, I transformed a personal productivity hack into a robust enterprise solution that makes creative teams' work more efficient and sustainable.",
    "tags": [
      "product management",
      "software development",
      "user experience design",
      "creative direction",
      "artificial intelligence",
      "enterprise software",
      "productivity tools"
    ],
    "featured": true,
    "visible": false
  }
]