[
  {
    "title": "Metitate.art",
    "slug": "metitate-art",
    "role": "Developer, Designer",
    "client": "Self-directed",
    "year": "2022",
    "tagline": "A portal to mindfulness, discovery, and the joy of reading art",
    "summary": "Metitate.art is my portal to mindfulness, discovery, and the joy of reading art. Over the past 2 years, it has evolved into a personal art history companion, guiding my personal exploration of the vast collection of The Metropolitan Museum of Art.\n<br/><br/>\nEach day on metitate.art, a new gallery is unveiled, showcasing objects ranging from European masterpieces to ancient sarcophagi. An algorithm of my own design prioritizes the most intriguing objects based on factors like age, materials, and artist renown.\n\nUsers can curate their own digital museums by collecting objects and adding them to their personal collections. This feature fosters a sense of ownership and encourages a deeper connection with art, as each collected artifact becomes exclusive to the user.\n<br/><br/>\n<a href=\"https://www.metitate.art\" target=\"_blank\">Visit Metitate.art</a>",
    "tags": [
      "web app",
      "product design",
      "product development",
      "web development",
      "javascript",
      "vue",
      "css",
      "html",
      "side project",
      "mindfulness",
      "ux design",
      "app"
    ],
    "featured": true,
    "visible": true
  },
  {
    "title": "Shooot",
    "slug": "shooot",
    "role": "Creator, Creative Director, Product Designer",
    "client": "Self-directed",
    "year": "2016",
    "tagline": "The camera for happy accidents",
    "summary": "Shooot was a camera app for iPhone that removed the distractions of smartphone photography. The app simulated the waiting period of old school film development by asking users to wait until the next morning to see their photos. Shooot also encouraged users to work without a viewfinder – helping them see the world through their own eyes. We called it \"The Camera for Happy Accidents\".\n\n<a href=\"https://www.instagram.com/explore/tags/shotwithshooot/\" target=\"_blank\">#shotwithshooot on Instagram</a>",
    "tags": [
      "mobile app",
      "photography",
      "camera",
      "film simulation",
      "minimalism",
      "user experience"
    ],
    "featured": false,
    "visible": true
  },
  {
    "title": "Finn",
    "slug": "finn",
    "role": "Creator, Co-lead, Creative Director",
    "client": "Indeed Creative",
    "year": "2024",
    "tagline": "Transforming creative feedback workflows with artificial intelligence",
    "summary": "What began as a personal solution to streamline creative feedback evolved into an effective AI-powered tool for Indeed's creative teams. I identified a critical pain point: creative professionals were spending excessive time processing and responding to feedback, leading to decreased productivity and creative burnout. Taking initiative, I developed a Chrome extension prototype that dramatically simplified feedback management.\n\nThe initial prototype showed clear impact, reducing feedback processing time and preserving creative energy. This success caught the attention of my colleagues, who saw its practical value in their daily work. Leveraging my technical expertise and understanding of creative workflows, I secured internal funding from Indeed to expand the project.\n\nThe result was Finn, an AI-driven product that not only accelerates feedback processing but also helps maintain creative momentum. By bridging my experience in creative direction with technical innovation, I transformed a personal productivity hack into a robust enterprise solution that makes creative teams' work more efficient and sustainable.",
    "tags": [
      "product management",
      "software development",
      "user experience design",
      "creative direction",
      "artificial intelligence",
      "enterprise software",
      "productivity tools"
    ],
    "featured": true,
    "visible": true
  },
  {
    "title": "Figtree",
    "slug": "figtree",
    "role": "Developer, Designer",
    "client": "Self-directed",
    "year": "2025",
    "tagline": "Copy links to Figma files, pages, frames, and groups from any tab",
    "summary": "Figtree is a lightweight Chrome extension that lets you share direct links to Figma files, pages, frames, and groups. Stay in the flow while writing feedback in Google Slides, giving direction in Asana, or referencing your team's projects anywhere on the web.",
    "tags": [
      "chrome extension",
      "figma",
      "productivity tools",
      "web development"
    ],
    "featured": true,
    "visible": true
  }
]